In [2]:
import numpy as np
import pandas as pd

Dataset Link - https://www.kaggle.com/datasets/programmerrdai/global-demographic-dynamics-population-trends/data

In [3]:
df1 = pd.read_csv('US_PopAgeStruct_20230713030811.csv')
df2 = pd.read_csv('US_PopDependency_20230713030812.csv')
df3 = pd.read_csv('US_PopGR_20230713030828.csv')
df4 = pd.read_csv('US_PopTotal_20230713030810.csv')

C:\Users\Dell\AppData\Local\Temp\ipykernel_12612\1497150668.py:1: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  df1 = pd.read_csv('US_PopAgeStruct_20230713030811.csv')

In [4]:
print(df1.shape)
print(df2.shape)
print(df3.shape)
print(df4.shape)

(2083686, 10)
(94410, 8)
(31884, 7)
(31571, 9)

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2083686 entries, 0 to 2083685
Data columns (total 10 columns):
 #   Column                                     Dtype
---  ------                                     -----
 0   Year                                       int64
 1   Economy                                    int64
 2   Economy Label                              object
 3   Sex                                        int64
 4   Sex Label                                  object
 5   AgeClass                                   int64
 6   AgeClass Label                             object
 7   Absolute value in thousands                float64
 8   Absolute value in thousands Footnote       object
 9   Absolute value in thousands Missing value  object
dtypes: float64(1), int64(4), object(5)
memory usage: 159.0+ MB

In [6]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 94410 entries, 0 to 94409
Data columns (total 8 columns):
 #   Column                                                Non-Null Count  Dtype
---  ------                                                --------------  -----
 0   Series                                                94410 non-null  int64
 1   Series Label                                          94410 non-null  object
 2   Year                                                  94410 non-null  int64
 3   Economy                                               94410 non-null  int64
 4   Economy Label                                         94410 non-null  object
 5   Persons per hundred persons aged 15-64                86775 non-null  float64
 6   Persons per hundred persons aged 15-64 Footnote       0 non-null      float64
 7   Persons per hundred persons aged 15-64 Missing value  7635 non-null   object
dtypes: float64(2), int64(3), object(3)
memory usage: 5.8+ MB

In [7]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31884 entries, 0 to 31883
Data columns (total 7 columns):
 #   Column                                    Non-Null Count  Dtype
---  ------                                    --------------  -----
 0   Period                                    31884 non-null  int64
 1   Period Label                              31884 non-null  object
 2   Economy                                   31884 non-null  int64
 3   Economy Label                             31884 non-null  object
 4   Annual average growth rate                29314 non-null  float64
 5   Annual average growth rate Footnote       6 non-null      object
 6   Annual average growth rate Missing value  2570 non-null   object
dtypes: float64(1), int64(2), object(4)
memory usage: 1.7+ MB

In [8]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31571 entries, 0 to 31570
Data columns (total 9 columns):
 #   Column                                                            Non-Null Count  Dtype
---  ------                                                            --------------  -----
 0   Year                                                              31571 non-null  int64
 1   Economy                                                           31571 non-null  int64
 2   Economy Label                                                     31571 non-null  object
 3   Absolute value in thousands                                       29026 non-null  float64
 4   Absolute value in thousands Footnote                              3 non-null      object
 5   Absolute value in thousands Missing value                         2545 non-null   object
 6   Urban population as percentage of total population                29026 non-null  float64
 7   Urban population as percentage of total population Footnote       0 non-null      float64
 8   Urban population as percentage of total population Missing value  2545 non-null   object
dtypes: float64(3), int64(2), object(4)
memory usage: 2.2+ MB

In [19]:
df1.head()

,Year,Economy,Economy Label,Sex,Sex Label,AgeClass,AgeClass Label,Absolute value in thousands,Absolute value in thousands Footnote,Absolute value in thousands Missing value
0,1950,1,Individual economies,0,Both sexes,0,All age classes,NaN,NaN,Not applicable
1,1950,1,Individual economies,0,Both sexes,1,[0-4],NaN,NaN,Not applicable
2,1950,1,Individual economies,0,Both sexes,2,[5-9],NaN,NaN,Not applicable
3,1950,1,Individual economies,0,Both sexes,3,[10-14],NaN,NaN,Not applicable
4,1950,1,Individual economies,0,Both sexes,4,[15-19],NaN,NaN,Not applicable

In [18]:
df3.head()

,Period,Period Label,Economy,Economy Label,Annual average growth rate,Annual average growth rate Footnote,Annual average growth rate Missing value
0,20162021,2016-2021,1,Individual economies,NaN,NaN,Not applicable
1,20162021,2016-2021,4,Afghanistan,2.92927,NaN,NaN
2,20162021,2016-2021,8,Albania,-0.18378,NaN,NaN
3,20162021,2016-2021,12,Algeria,1.81799,NaN,NaN
4,20162021,2016-2021,16,American Samoa,-2.27006,NaN,NaN

Cleaning df3 to replace period, period label with year.

In [15]:
df3['Period'].unique()

array([20162021, 20212050, 19501951, 19511952, 19521953, 19531954,
       19541955, 19551956, 19561957, 19571958, 19581959, 19591960,
       19601961, 19611962, 19621963, 19631964, 19641965, 19651966,
       19661967, 19671968, 19681969, 19691970, 19701971, 19711972,
       19721973, 19731974, 19741975, 19751976, 19761977, 19771978,
       19781979, 19791980, 19801981, 19811982, 19821983, 19831984,
       19841985, 19851986, 19861987, 19871988, 19881989, 19891990,
       19901991, 19911992, 19921993, 19931994, 19941995, 19951996,
       19961997, 19971998, 19981999, 19992000, 20002001, 20012002,
       20022003, 20032004, 20042005, 20052006, 20062007, 20072008,
       20082009, 20092010, 20102011, 20112012, 20122013, 20132014,
       20142015, 20152016, 20162017, 20172018, 20182019, 20192020,
       20202021, 20212022, 20222023, 20232024, 20242025, 20252026,
       20262027, 20272028, 20282029, 20292030, 20302031, 20312032,
       20322033, 20332034, 20342035, 20352036, 20362037, 20372038,
       20382039, 20392040, 20402041, 20412042, 20422043, 20432044,
       20442045, 20452046, 20462047, 20472048, 20482049, 20492050],
      dtype=int64)

In [21]:
def average_period(period):
    start_year = int(str(period)[:4])
    end_year = int(str(period)[4:])
    return (start_year+end_year)//2

In [24]:
df3['Year'] = df3['Period'].apply(average_period)

In [25]:
df3.head()

,Period,Period Label,Economy,Economy Label,Annual average growth rate,Annual average growth rate Footnote,Annual average growth rate Missing value,Year
0,20162021,2016-2021,1,Individual economies,NaN,NaN,Not applicable,2018
1,20162021,2016-2021,4,Afghanistan,2.92927,NaN,NaN,2018
2,20162021,2016-2021,8,Albania,-0.18378,NaN,NaN,2018
3,20162021,2016-2021,12,Algeria,1.81799,NaN,NaN,2018
4,20162021,2016-2021,16,American Samoa,-2.27006,NaN,NaN,2018

In [27]:
df3 = df3.drop(['Period', 'Period Label'], axis=1)
df3.head()

,Economy,Economy Label,Annual average growth rate,Annual average growth rate Footnote,Annual average growth rate Missing value,Year
0,1,Individual economies,NaN,NaN,Not applicable,2018
1,4,Afghanistan,2.92927,NaN,NaN,2018
2,8,Albania,-0.18378,NaN,NaN,2018
3,12,Algeria,1.81799,NaN,NaN,2018
4,16,American Samoa,-2.27006,NaN,NaN,2018

Task-1 Merging files into a single DataFrame

In [28]:
df_merged_1_2 = pd.merge(df1, df2, on=['Year', 'Economy', 'Economy Label'], how='outer')
df_merged_1_2_3 = pd.merge(df_merged_1_2, df3, on=['Year', 'Economy', 'Economy Label'], how='outer')
df_final = pd.merge(df_merged_1_2_3, df4, on=['Year', 'Economy', 'Economy Label'], how='outer')
df_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6361410 entries, 0 to 6361409
Data columns (total 24 columns):
 #   Column                                                            Dtype
---  ------                                                            -----
 0   Year                                                              int64
 1   Economy                                                           int64
 2   Economy Label                                                     object
 3   Sex                                                               int64
 4   Sex Label                                                         object
 5   AgeClass                                                          int64
 6   AgeClass Label                                                    object
 7   Absolute value in thousands_x                                     float64
 8   Absolute value in thousands Footnote_x                            object
 9   Absolute value in thousands Missing value_x                       object
 10  Series                                                            float64
 11  Series Label                                                      object
 12  Persons per hundred persons aged 15-64                            float64
 13  Persons per hundred persons aged 15-64 Footnote                   float64
 14  Persons per hundred persons aged 15-64 Missing value              object
 15  Annual average growth rate                                        float64
 16  Annual average growth rate Footnote                               object
 17  Annual average growth rate Missing value                          object
 18  Absolute value in thousands_y                                     float64
 19  Absolute value in thousands Footnote_y                            object
 20  Absolute value in thousands Missing value_y                       object
 21  Urban population as percentage of total population                float64
 22  Urban population as percentage of total population Footnote       float64
 23  Urban population as percentage of total population Missing value  object
dtypes: float64(8), int64(4), object(12)
memory usage: 1.1+ GB

Task-2 Data Cleaning

In [29]:
df_final.isnull().sum()

Year                                                                      0
Economy                                                                   0
Economy Label                                                             0
Sex                                                                       0
Sex Label                                                                 0
AgeClass                                                                  0
AgeClass Label                                                            0
Absolute value in thousands_x                                        515753
Absolute value in thousands Footnote_x                              6361401
Absolute value in thousands Missing value_x                         5845657
Series                                                                 6798
Series Label                                                           6798
Persons per hundred persons aged 15-64                               515856
Persons per hundred persons aged 15-64 Footnote                     6361410
Persons per hundred persons aged 15-64 Missing value                5852352
Annual average growth rate                                           570702
Annual average growth rate Footnote                                 6360222
Annual average growth rate Missing value                            5852550
Absolute value in thousands_y                                        509058
Absolute value in thousands Footnote_y                              6360816
Absolute value in thousands Missing value_y                         5852352
Urban population as percentage of total population                   509058
Urban population as percentage of total population Footnote         6361410
Urban population as percentage of total population Missing value    5852352
dtype: int64

Dropping unnecessary columns

In [30]:
columns_to_drop = ['Absolute value in thousands Footnote_x', 
                   'Absolute value in thousands Missing value_x', 
                   'Persons per hundred persons aged 15-64 Footnote', 
                   'Persons per hundred persons aged 15-64 Missing value', 
                   'Annual average growth rate Footnote', 
                   'Annual average growth rate Missing value', 
                   'Absolute value in thousands Footnote_y', 
                   'Absolute value in thousands Missing value_y', 
                   'Urban population as percentage of total population Footnote', 
                   'Urban population as percentage of total population Missing value']

In [31]:
df_final = df_final.drop(columns=columns_to_drop, axis=1)
df_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6361410 entries, 0 to 6361409
Data columns (total 14 columns):
 #   Column                                              Dtype
---  ------                                              -----
 0   Year                                                int64
 1   Economy                                             int64
 2   Economy Label                                       object
 3   Sex                                                 int64
 4   Sex Label                                           object
 5   AgeClass                                            int64
 6   AgeClass Label                                      object
 7   Absolute value in thousands_x                       float64
 8   Series                                              float64
 9   Series Label                                        object
 10  Persons per hundred persons aged 15-64              float64
 11  Annual average growth rate                          float64
 12  Absolute value in thousands_y                       float64
 13  Urban population as percentage of total population  float64
dtypes: float64(6), int64(4), object(4)
memory usage: 679.5+ MB

In [32]:
df_final.isnull().sum()

Year                                                       0
Economy                                                    0
Economy Label                                              0
Sex                                                        0
Sex Label                                                  0
AgeClass                                                   0
AgeClass Label                                             0
Absolute value in thousands_x                         515753
Series                                                  6798
Series Label                                            6798
Persons per hundred persons aged 15-64                515856
Annual average growth rate                            570702
Absolute value in thousands_y                         509058
Urban population as percentage of total population    509058
dtype: int64

In [33]:
numeric_columns = df_final.select_dtypes(include=['float64', 'int64']).columns
numeric_columns

Index(['Year', 'Economy', 'Sex', 'AgeClass', 'Absolute value in thousands_x',
       'Series', 'Persons per hundred persons aged 15-64',
       'Annual average growth rate', 'Absolute value in thousands_y',
       'Urban population as percentage of total population'],
      dtype='object')

In [34]:
for col in numeric_columns:
    df_final[col] = df_final[col].fillna(df_final[col].mean())

In [35]:
df_final.isnull().sum()

Year                                                     0
Economy                                                  0
Economy Label                                            0
Sex                                                      0
Sex Label                                                0
AgeClass                                                 0
AgeClass Label                                           0
Absolute value in thousands_x                            0
Series                                                   0
Series Label                                          6798
Persons per hundred persons aged 15-64                   0
Annual average growth rate                               0
Absolute value in thousands_y                            0
Urban population as percentage of total population       0
dtype: int64

In [36]:
object_columns = df_final.select_dtypes(include=['object']).columns
object_columns

Index(['Economy Label', 'Sex Label', 'AgeClass Label', 'Series Label'], dtype='object')

In [37]:
for col in object_columns:
    df_final[col] = df_final[col].fillna(df_final[col].mode()[0])

In [38]:
df_final.isnull().sum()

Year                                                  0
Economy                                               0
Economy Label                                         0
Sex                                                   0
Sex Label                                             0
AgeClass                                              0
AgeClass Label                                        0
Absolute value in thousands_x                         0
Series                                                0
Series Label                                          0
Persons per hundred persons aged 15-64                0
Annual average growth rate                            0
Absolute value in thousands_y                         0
Urban population as percentage of total population    0
dtype: int64

In [40]:
df_final.head()

,Year,Economy,Economy Label,Sex,Sex Label,AgeClass,AgeClass Label,Absolute value in thousands_x,Series,Series Label,Persons per hundred persons aged 15-64,Annual average growth rate,Absolute value in thousands_y,Urban population as percentage of total population
0,1950,0,World,0,Both sexes,0,All age classes,2499322.166,7120.0,Total dependency ratio,66.242,1.73762,2499322.166,29.63511
1,1950,0,World,0,Both sexes,0,All age classes,2499322.166,7121.0,Old-age dependency ratio,8.528,1.73762,2499322.166,29.63511
2,1950,0,World,0,Both sexes,0,All age classes,2499322.166,7122.0,Child dependency ratio,57.714,1.73762,2499322.166,29.63511
3,1950,0,World,0,Both sexes,1,[0-4],341876.795,7120.0,Total dependency ratio,66.242,1.73762,2499322.166,29.63511
4,1950,0,World,0,Both sexes,1,[0-4],341876.795,7121.0,Old-age dependency ratio,8.528,1.73762,2499322.166,29.63511

In [41]:
df_final.to_csv('cleaned_data.csv', index=False)